package Lesson1;


// Задача - Время года ID задачи 0892

// Условия задачи
/*По заданному номеру месяца в году требуется определить время года.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N (N≤100) – номер месяца.

Выходные данные
В выходной файл OUTPUT.TXT выведите для летних месяцев значение «Summer»,
для зимних – «Winter», для весенних – «Spring», для осенних – «Autumn».
Если число не соответствует возможному значению месяца, то в этом случае следует вывести «Error».*/

public class Seasons
{
}
